cf_billing/DataProcessors/бестВыгрузкаИнтервальныхДанныхExcel.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бестВыгрузкаИнтервальныхДанныхExcel</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cf_billing/InformationRegisters/бестСвязьДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестСвязьДоговоров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СвязанныйДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОснованиеДляДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестДоговорыТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестДоговорыТочекУчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестПриборыТочекУчетаНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестПриборыТочекУчетаНП</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестДанныеПочасовойВедомости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестДанныеПочасовойВедомости</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчитыватьКоэффициентПУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>План</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>День</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Час</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестАктивностьТочекУчетаНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестАктивностьТочекУчетаНП</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСостояниеТочекУчета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Enums/энргСостояниеТочекУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргСостояниеТочекУчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Включена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отключена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОРП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоТП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Catalogs/энргПриборыУчетаАбонента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргПриборыУчетаАбонента</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодАСКУЭ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальноВозможныеПоказания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКанальности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыКанальности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПрибораУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТипыПриборовУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрируетОбъем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипУзлаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТипыУзловУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобственникАСКУЭ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СистемаУчетаЭлектроэнергии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСистемыУчетаЭлектроэнергии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИнтеграцииССистемой</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобственникСИ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргБалансоваяПринадлежность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасположениеИзмерителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргРасположениеИзмерителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыпуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фаза</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргФазыТрансформатора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БалансоваяПринадлежность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргБалансоваяПринадлежность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТочкиУчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучасовыеЗначения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеВатт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеСПотерями</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффициентТрансформации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПонижающийКоэффициент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Измерители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Измеритель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/DataProcessors/бестВыгрузкаИнтервальныхДанныхExcel/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьДанныеВыгрузки(ПараметрыВыгрузки) Экспорт	
	РезультатЗапроса = РезультатЗапросаДанныхВыгрузки(ПараметрыВыгрузки);
	ЗаполнитьТабличныйДокумент(ПараметрыВыгрузки, РезультатЗапроса);	
КонецПроцедуры

Функция ПрочитатьПотокФайлов(ПараметрыФункции, МассивДвоичныхФайлов) Экспорт
	
	ИмяЗадания = "Загрузить данные почасовой ведомости";
	Попытка
		ExcelApp = Новый COMОбъект("Excel.Application");
	Исключение 
		Комментарий = "Ошибка при попытке создать объект ""MS Excel""! 
		              |Возможно приложение ""MS Excel"" не установлено или установлено неправильно. " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(ИмяЗадания, УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
		Возврат Неопределено;
	КонецПопытки; 
	
	СозданныеДокументы = Новый Соответствие;
	Для Каждого ДанныеФайла из МассивДвоичныхФайлов Цикл
		
		Попытка
			Если ДанныеФайла.РасширениеФайла = ".xls" Тогда
				ПутьКФайлу = ПолучитьИмяВременногоФайла("xls");
			Иначе
				ПутьКФайлу = ПолучитьИмяВременногоФайла("xlsx");
			КонецЕсли; 
			ДДФайла = ДанныеФайла.Файл;
			ДДФайла.Записать(ПутьКФайлу);
			Книга = ExcelApp.Workbooks.Open(ПутьКФайлу);
		Исключение
			Комментарий = "Не удалось открыть файл. Возможно, он открыт в другом приложении. " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(ИмяЗадания, УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
			Продолжить;
		КонецПопытки;
		
		Попытка
			Страница = Книга.Worksheets(1);
		Исключение
			Комментарий = "Не удалось найти лист в файле. " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(ИмяЗадания, УровеньЖурналаРегистрации.Ошибка,,, Комментарий);
			ExcelApp.Quit();
			Продолжить;
		КонецПопытки;
		
		ПараметрыФункции.ФайлДляЧтения = ДанныеФайла.ФайлДляЧтения;
		ПараметрыФункции.ТаблицаПУ.Очистить();
		ПараметрыФункции.ПредоставленныеОбъемы.Очистить();
		ПрочитатьЛистExcel(Страница, ПараметрыФункции);
		ExcelApp.Quit();
		
		ДокументЗагрузки = ЗагрузитьДанныеПочасовойВедомости(ПараметрыФункции);
		Если ДокументЗагрузки <> Неопределено Тогда
			СозданныеДокументы.Вставить(ДокументЗагрузки, ДанныеФайла.ФайлДляЧтения);
		КонецЕсли; 
		
	КонецЦикла;  
	Возврат СозданныеДокументы;
	
КонецФункции

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

#Область Выгрузка

Функция РезультатЗапросаДанныхВыгрузки(ПараметрыВыгрузки)
	Схема = Новый СхемаЗапроса;
	
	ПараметрыСхемы 	= Новый Структура;
	ПараметрыСхемы.Вставить("Договор", ПараметрыВыгрузки.Договор);
	ПараметрыСхемы.Вставить("Дата", ПараметрыВыгрузки.Дата);
	ПараметрыСхемы.Вставить("Организация", ПараметрыВыгрузки.Организация);
	ПараметрыСхемы.Вставить("Район", ПараметрыВыгрузки.Район);
	
	Схема.УстановитьТекстЗапроса(ТекстЗапросаПочасовка());

	Если ПараметрыВыгрузки.Доходный Тогда 
		НаименованиеПоляСвязи = ".Доходный";
	Иначе
		НаименованиеПоляСвязи = ".Расходный";
	КонецЕсли;
	
	ОператорПакета = Схема.ПакетЗапросов[5].Операторы[0];	
	ОсновнойИсточник = ОператорПакета.Источники.НайтиПоИмени("ВТ_Расходные");  
	ОсновнойИсточник.Соединения[0].Условие = Новый ВыражениеСхемыЗапроса(ОсновнойИсточник.Источник.Псевдоним + НаименованиеПоляСвязи + "= энргДоговорыКонтрагентов.Ссылка");	
	
	Результат = энргСхемаЗапросаСервер.ВыполнитьПакет(Схема, ПараметрыВыгрузки);
	Возврат Результат; 	
КонецФункции

Функция ТекстЗапросаПочасовка()
	Текст = 
	"ВЫБРАТЬ
	|	бестСвязьДоговоров.СвязанныйДоговор КАК Расходный,
	|	бестСвязьДоговоров.ОснованиеДляДоговора КАК Доходный
	|ПОМЕСТИТЬ ВТ_Расходные
	|ИЗ
	|	РегистрСведений.бестСвязьДоговоров КАК бестСвязьДоговоров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|		ПО бестСвязьДоговоров.СвязанныйДоговор = энргДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	бестСвязьДоговоров.ОснованиеДляДоговора = &Договор
	|	И энргДоговорыКонтрагентов.Организация = &Организация
	|	И энргДоговорыКонтрагентов.Район = &Район
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестДоговорыТочекУчетаСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	|	бестДоговорыТочекУчетаСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	|	бестДоговорыТочекУчетаСрезПоследних.Услуга КАК Услуга,
	|	бестДоговорыТочекУчетаСрезПоследних.Договор КАК Договор
	|ПОМЕСТИТЬ ВТ_ТочкиУчета
	|ИЗ
	|	РегистрСведений.бестДоговорыТочекУчета.СрезПоследних(
	|			&Дата,
	|			Организация = &Организация
	|				И Район = &Район) КАК бестДоговорыТочекУчетаСрезПоследних
	|ГДЕ
	|	бестДоговорыТочекУчетаСрезПоследних.Договор = &Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестПриборыТочекУчетаНП.ТочкаУчета КАК ТочкаУчета,
	|	бестПриборыТочекУчетаНП.ОбъектРасчета КАК ОбъектРасчета,
	|	бестПриборыТочекУчетаНП.ПриборУчета КАК ПриборУчета,
	|	бестПриборыТочекУчетаНП.Организация КАК Организация,
	|	бестПриборыТочекУчетаНП.Район КАК Район
	|ПОМЕСТИТЬ ВТ_ПриборыУчета
	|ИЗ
	|	РегистрСведений.бестПриборыТочекУчетаНП.СрезПоследних(
	|			&Дата,
	|			Организация = &Организация
	|				И Район = &Район
	|				И (ОбъектРасчета, ТочкаУчета) В
	|					(ВЫБРАТЬ
	|						ВТ_ТочкиУчета.ОбъектРасчета,
	|						ВТ_ТочкиУчета.ТочкаУчета
	|					ИЗ
	|						ВТ_ТочкиУчета)) КАК бестПриборыТочекУчетаНП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	бестДанныеПочасовойВедомости.Организация КАК Организация,
	|	бестДанныеПочасовойВедомости.Район КАК Район,
	|	бестДанныеПочасовойВедомости.ОбъектРасчета КАК ОбъектРасчета,
	|	бестДанныеПочасовойВедомости.ТочкаУчета КАК ТочкаУчета,
	|	бестДанныеПочасовойВедомости.ПриборУчета КАК ПриборУчета,
	|	бестДанныеПочасовойВедомости.Час КАК Час,
	|	бестДанныеПочасовойВедомости.Объем КАК Объем,
	|	бестДанныеПочасовойВедомости.ПериодНачисления КАК ПериодНачисления,
	|	бестДанныеПочасовойВедомости.День КАК День
	|ПОМЕСТИТЬ ВТ_ДанныеЧасы
	|ИЗ
	|	РегистрСведений.бестДанныеПочасовойВедомости КАК бестДанныеПочасовойВедомости
	|ГДЕ
	|	бестДанныеПочасовойВедомости.Организация = &Организация
	|	И бестДанныеПочасовойВедомости.Район = &Район
	|	И бестДанныеПочасовойВедомости.ПериодНачисления = &Дата
	|	И (бестДанныеПочасовойВедомости.ОбъектРасчета, бестДанныеПочасовойВедомости.ТочкаУчета, бестДанныеПочасовойВедомости.ПриборУчета) В
	|			(ВЫБРАТЬ
	|				ВТ_ПриборыУчета.ОбъектРасчета,
	|				ВТ_ПриборыУчета.ТочкаУчета,
	|				ВТ_ПриборыУчета.ПриборУчета
	|			ИЗ
	|				ВТ_ПриборыУчета)
	|	И НЕ бестДанныеПочасовойВедомости.План
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеЧасы.Организация КАК Организация,
	|	ВТ_ДанныеЧасы.Район КАК Район,
	|	ВТ_ДанныеЧасы.ПриборУчета КАК ПриборУчета,
	|	ВТ_ДанныеЧасы.Час КАК Час,
	|	СУММА(ВТ_ДанныеЧасы.Объем) КАК Объем,
	|	ВТ_ДанныеЧасы.День КАК День
	|ПОМЕСТИТЬ ВТ_ДанныеЧасыСумма
	|ИЗ
	|	ВТ_ДанныеЧасы КАК ВТ_ДанныеЧасы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеЧасы.Организация,
	|	ВТ_ДанныеЧасы.Район,
	|	ВТ_ДанныеЧасы.ПриборУчета,
	|	ВТ_ДанныеЧасы.Час,
	|	ВТ_ДанныеЧасы.День
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Организации.ИНН КАК ИНН,
	|	Организации.Представление КАК ОрганизацияПредставление,
	|	энргДоговорыКонтрагентов.Представление КАК Представление,
	|	энргДоговорыКонтрагентов.Номер КАК ДоговорНомер
	|ИЗ
	|	ВТ_Расходные КАК ВТ_Расходные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргДоговорыКонтрагентов КАК энргДоговорыКонтрагентов
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|			ПО энргДоговорыКонтрагентов.Организация = Организации.Ссылка
	|		ПО ВТ_Расходные.Расходный = энргДоговорыКонтрагентов.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ПриборыУчета.ПриборУчета КАК ПриборУчета,
	|	ЕСТЬNULL(энргТипыПриборовУчета.Наименование, """") КАК ТипПУ,
	|	энргПриборыУчетаАбонента.КодТочкиУчета КАК КодТУ,
	|	энргПриборыУчетаАбонента.Код КАК ЗаводскойНомерПУ,
	|	ВЫБОР
	|		КОГДА НЕ энргПриборыУчетаАбонента.ДанныеСПотерями
	|				И НЕ энргПриборыУчетаАбонента.КоэффициентТрансформации
	|			ТОГДА ""0""
	|		КОГДА НЕ энргПриборыУчетаАбонента.ДанныеСПотерями
	|				И энргПриборыУчетаАбонента.КоэффициентТрансформации
	|			ТОГДА ""1""
	|		КОГДА энргПриборыУчетаАбонента.ДанныеСПотерями
	|				И энргПриборыУчетаАбонента.КоэффициентТрансформации
	|			ТОГДА ""2""
	|		КОГДА энргПриборыУчетаАбонента.ДанныеСПотерями
	|				И НЕ энргПриборыУчетаАбонента.КоэффициентТрансформации
	|			ТОГДА ""3""
	|	КОНЕЦ КАК ПризнакКоэффициента,
	|	""1"" КАК КаналПоУмолчанию
	|ИЗ
	|	ВТ_ПриборыУчета КАК ВТ_ПриборыУчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.энргТипыПриборовУчета КАК энргТипыПриборовУчета
	|			ПО энргПриборыУчетаАбонента.ТипПрибораУчета = энргТипыПриборовУчета.Ссылка
	|		ПО ВТ_ПриборыУчета.ПриборУчета = энргПриборыУчетаАбонента.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПриборУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеЧасыСумма.ПриборУчета КАК ПриборУчета,
	|	ВТ_ДанныеЧасыСумма.Час КАК Час,
	|	ВТ_ДанныеЧасыСумма.Объем КАК Объем,
	|	ВТ_ДанныеЧасыСумма.День КАК День
	|ИЗ
	|	ВТ_ДанныеЧасыСумма КАК ВТ_ДанныеЧасыСумма
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПриборУчета,
	|	День,
	|	Час
	|ИТОГИ ПО
	|	День";  
	
	Возврат Текст;
КонецФункции     

Процедура ЗаполнитьТабличныйДокумент(ПараметрыВыгрузки, РезультатЗапроса)
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ПУ", Новый ОписаниеТипов("СправочникСсылка.энргПриборыУчетаАбонента"));
	ТЗ.Колонки.Добавить("НомерКолонки", Новый ОписаниеТипов("Число"));
	
	ТабличныйДокумент 	= ПараметрыВыгрузки.ТабличныйДокумент;
	ТабличныйДокументТело = Новый ТабличныйДокумент;
	ПакетГолова = РезультатЗапроса[5];
	ПакетПриборы = РезультатЗапроса[6]; 
	ПакетОбъемы = РезультатЗапроса[7];
	
	МакетШапки = УправлениеПечатью.МакетПечатнойФормы("Обработка.бестВыгрузкаИнтервальныхДанныхExcel.ШаблонШапка");
	МакетТело = УправлениеПечатью.МакетПечатнойФормы("Обработка.бестВыгрузкаИнтервальныхДанныхExcel.ШаблонТело");	
	ОбластьШапки = МакетШапки.ПолучитьОбласть("ДанныеГолова");
	ОбластьДанныеШапкаВерх = МакетТело.ПолучитьОбласть("ДанныеШапкаВерх");
	ОбластьДанныеСчетчикВерх = МакетТело.ПолучитьОбласть("ДанныеСчетчикВерх");
		
	ВыбоГолова = ПакетГолова.Выбрать(); 
	Если ВыбоГолова.Следующий() Тогда 
		ОбластьШапки.Параметры.Заполнить(ВыбоГолова); 	
	КонецЕсли; 
	Табличныйдокумент.Вывести(ОбластьШапки);  
	ТабличныйДокументТело.Вывести(ОбластьДанныеШапкаВерх);
	
	ВыборкаТелоПУ = ПакетПриборы.Выбрать();  
	НомерСчетчика = 1;
	Пока ВыборкаТелоПУ.Следующий() Цикл
		ОбластьДанныеСчетчикВерх.Параметры.Заполнить(ВыборкаТелоПУ);
		ОбластьДанныеСчетчикВерх.параметры.ПорядокСчетчик = "Счетчик" + Строка(НомерСчетчика);
		ТабличныйДокументТело.Присоединить(ОбластьДанныеСчетчикВерх); 
		
		НоваяСтрокаОбъем = ТЗ.Добавить();
		НоваяСтрокаОбъем.ПУ = ВыборкаТелоПУ.ПриборУчета; 
		НоваяСтрокаОбъем.НомерКолонки = 2 + НомерСчетчика;
		НомерСчетчика = НомерСчетчика + 1;
	КонецЦикла; 
	
	ВысотаМакетаТело = ТабличныйДокументТело.ВысотаТаблицы - 1;
	ШиринаМакетаТело = ТабличныйДокументТело.ШиринаТаблицы;
	ТабличныйДокумент.ВставитьОбласть(ТабличныйДокументТело.Область(1, 1, ВысотаМакетаТело, ШиринаМакетаТело), ТабличныйДокумент.Область(8, 1, 8 + ВысотаМакетаТело, ШиринаМакетаТело));  
	
	Если ПараметрыВыгрузки.Доходный Тогда   
		ВывестиПустойШаблон(ПараметрыВыгрузки.Дата, МакетТело, ТабличныйДокумент);				
	Иначе
		ВывестиОбъемы(ПакетОбъемы, МакетТело, ТабличныйДокумент, ТЗ);
	КонецЕсли;
	
	НастроитьОформлениеТД(ТЗ, ТабличныйДокумент, ШиринаМакетаТело);	
	
КонецПроцедуры

Процедура НастроитьОформлениеТД(ТЗ, ТабличныйДокумент, ШиринаМакетаТело) 
	
	// ширина
	ОбластьКолонка = ТабличныйДокумент.Область(1, 1, ТабличныйДокумент.ВысотаТаблицы, 1);
	ОбластьКолонка.ШиринаКолонки = 20;
	ОбластьКолонка = ТабличныйДокумент.Область(1, 2, ТабличныйДокумент.ВысотаТаблицы, 2);
	ОбластьКолонка.ШиринаКолонки = 25;
	
	Для Счетчик = 3 По ШиринаМакетаТело Цикл
		ОбластьКолонка = ТабличныйДокумент.Область(1, Счетчик, ТабличныйДокумент.ВысотаТаблицы, Счетчик);
		ОбластьКолонка.ШиринаКолонки = 30;
	КонецЦикла;
	
	// оформление 
	Если ТЗ.Количество()> 0 Тогда
		ТабличныйДокумент.Область(15, 3, 15, ШиринаМакетаТело).Объединить();
	КонецЕсли;
	
КонецПроцедуры 

Процедура ВывестиПустойШаблон(ОтборДата, МакетТело, ТабличныйДокумент) 
	
	ОбластьДанныеСтрокаДень = МакетТело.ПолучитьОбласть("ДанныеСтроки|ДанныеШапкаВерх");
	ОбластьДанныеСтрокаОбъем = МакетТело.ПолучитьОбласть("ДанныеСтроки|ДанныеСчетчикВерх"); 
	
	ТекДата = НачалоМесяца(ОтборДата);
	Пока ТекДата <= НачалоДня(КонецМесяца(ОтборДата)) Цикл
		
		Для Час = 0 По 23 Цикл
			ОбластьДанныеСтрокаДень.Параметры.Дата = НачалоДня(ТекДата);
			ОбластьДанныеСтрокаДень.Параметры.Час = Строка(Час);
			ТабличныйДокумент.Вывести(ОбластьДанныеСтрокаДень);
			
			Для Счетчик = 3 По ТабличныйДокумент.ШиринаТаблицы Цикл 
				ОбластьДанныеСтрокаОбъем.Параметры.Объем = "0";
				ТабличныйДокумент.Присоединить(ОбластьДанныеСтрокаОбъем);  
			КонецЦикла;  
		КонецЦикла;
		
		ТекДата = КонецДня(ТекДата) + 1;
	КонецЦикла;
	
КонецПроцедуры 

Процедура ВывестиОбъемы(ПакетОбъемы, МакетТело, ТабличныйДокумент, ТЗ)
	
	ОбластьДанныеСтрокаДень = МакетТело.ПолучитьОбласть("ДанныеСтроки|ДанныеШапкаВерх");
	ОбластьДанныеСтрокаОбъем = МакетТело.ПолучитьОбласть("ДанныеСтроки|ДанныеСчетчикВерх"); 
	
	ВыборкаТелоДень = ПакетОбъемы.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	Пока ВыборкаТелоДень.Следующий() Цикл 
		ВыборкаТелоПУОбъемы = ВыборкаТелоДень.Выбрать(); 
		Для Час = 0 По 23 Цикл
			ОбластьДанныеСтрокаДень.Параметры.Дата = ВыборкаТелоДень.День;
			ОбластьДанныеСтрокаДень.Параметры.Час = Строка(Час);
			ТабличныйДокумент.Вывести(ОбластьДанныеСтрокаДень);
			
			Для Счетчик = 3 По ТабличныйДокумент.ШиринаТаблицы Цикл 
				ОбластьДанныеСтрокаОбъем.Параметры.Объем = "0";
				ТабличныйДокумент.Присоединить(ОбластьДанныеСтрокаОбъем);  
			КонецЦикла;  
			
			ВыборкаТелоПУОбъемы.Сбросить();
			Пока ВыборкаТелоПУОбъемы.НайтиСледующий(Новый Структура("Час", Час)) Цикл				
				Объем = ВыборкаТелоПУОбъемы.Объем;
				НомерКолонки = ТЗ.Найти(ВыборкаТелоПУОбъемы.ПриборУчета).НомерКолонки;
				ТабличныйДокумент.Область("R" + ТабличныйДокумент.ВысотаТаблицы + "C" + НомерКолонки).Текст = Строка(Объем); 
			КонецЦикла;  
		КонецЦикла;  
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#Область Загрузка

Функция ЗагрузитьДанныеПочасовойВедомости(ПараметрыДокумента) Экспорт
	
	ВсеОбъемы = ПараметрыДокумента.ПредоставленныеОбъемы;
	ОтборПоПу = Новый Структура("IDСтроки");
	
	РезультатЗапроса = РезультатЗапросаЗагрузитьДанные(ПараметрыДокумента);
	ВыборкаИтог = РезультатЗапроса[РезультатЗапроса.Количество() - 2].Выбрать();
	ВыборкаЗагруженныеДанные = РезультатЗапроса[РезультатЗапроса.Количество() - 1].Выбрать();
	
	Если ВыборкаЗагруженныеДанные.Следующий() Тогда
		ДокЗагруженныеДанные = ВыборкаЗагруженныеДанные.Ссылка.ПолучитьОбъект();
		ДокЗагруженныеДанные.ЗагруженныеДанные.Очистить();
		ДокЗагруженныеДанные.ПредоставленныеОбъемы.Очистить();
	Иначе
		ДокЗагруженныеДанные = Документы.бестЗагруженныеДанныеИзВнешнихИсточников.СоздатьДокумент();
	КонецЕсли; 
	
    ЗаполнитьЗначенияСвойств(ДокЗагруженныеДанные, ПараметрыДокумента);
	
	Пока ВыборкаИтог.Следующий() Цикл
		СтрЗагруженныеДанные = ДокЗагруженныеДанные.ЗагруженныеДанные.Добавить();
		СтрЗагруженныеДанные.ВидОперации = ПараметрыДокумента.ВидОперации;
		СтрЗагруженныеДанные.IDСтроки = Новый УникальныйИдентификатор(ВыборкаИтог.IDСтроки);
		СтрЗагруженныеДанные.УчитыватьКоэффициентПУ = ПараметрыДокумента.УчитыватьКоэффициентПУ;
		Если Не ЗначениеЗаполнено(ВыборкаИтог.ПриборУчета) Или Не ЗначениеЗаполнено(ВыборкаИтог.ТочкаУчета) Тогда
			СтрЗагруженныеДанные.ГотовКОбработке = Ложь;
			СтрЗагруженныеДанные.ТочкаУчетаИзФайла = ВыборкаИтог.ТочкаУчетаИзФайла;
			СтрЗагруженныеДанные.ПриборУчетаИзФайла = ВыборкаИтог.ПриборУчетаИзФайла;
		Иначе
			ЗаполнитьЗначенияСвойств(СтрЗагруженныеДанные, ВыборкаИтог,, "IDСтроки");
			СтрЗагруженныеДанные.ПериодНачисления = Обработки.бестГраницыПериодаНачисленияМенеджер.ОпределитьПериодНачисления(ПараметрыДокумента.Дата, ВыборкаИтог.Организация, ВыборкаИтог.Район);
			СтрЗагруженныеДанные.ГотовКОбработке = Истина;
		КонецЕсли;
		
		ОтборПоПу.IDСтроки = ВыборкаИтог.IDСтроки;
		СтрокиОбъемы = ВсеОбъемы.НайтиСтроки(ОтборПоПу);
		Для Каждого СтрокаОбъем из СтрокиОбъемы Цикл
			СтрПредоставленныеОбъемы = ДокЗагруженныеДанные.ПредоставленныеОбъемы.Добавить();
			ЗаполнитьЗначенияСвойств(СтрПредоставленныеОбъемы, СтрокаОбъем,, "IDСтроки");
			СтрПредоставленныеОбъемы.IDСтроки = СтрЗагруженныеДанные.IDСтроки;
		КонецЦикла;
	КонецЦикла;
	
	НачатьТранзакцию();
	Попытка
		ДокЗагруженныеДанные.ДополнительныеСвойства.Вставить("МассоваяЗагрузка", Истина);
		ДокЗагруженныеДанные.Записать();
		ЗафиксироватьТранзакцию();
		Возврат ДокЗагруженныеДанные.Ссылка;
	Исключение
		ОтменитьТранзакцию();
		
		ОписаниеОшибки 	= ИнформацияОбОшибке();
		ДопИнформация 	= "Путь к файлу: " + ПараметрыДокумента.ФайлДляЧтения;
		бестИнтеграции.ЗафиксироватьОшибкуЗаписиОбъектРегистрацииПоказанийИзВнешнихИсточников("Загрузить данные почасовой ведомости", ОписаниеОшибки, ДопИнформация);
		Возврат Неопределено;
	КонецПопытки;
КонецФункции

Функция РезультатЗапросаЗагрузитьДанные(Отборы)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТаблицаПУ.IDСтроки КАК IDСтроки,
	                      |	ТаблицаПУ.ПриборУчета КАК НомерПУ,
	                      |	ТаблицаПУ.КодТУ КАК КодТУ,
	                      |	ТаблицаПУ.ТипПУ КАК ТипПУ
	                      |ПОМЕСТИТЬ ТаблицаПУ
	                      |ИЗ
	                      |	&ТаблицаПУ КАК ТаблицаПУ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	энргПриборыУчетаАбонента.Ссылка КАК Ссылка,
	                      |	ТаблицаПУ.IDСтроки КАК IDСтроки,
	                      |	ТаблицаПУ.КодТУ КАК КодТУ,
	                      |	ТаблицаПУ.НомерПУ КАК НомерПУ
	                      |ПОМЕСТИТЬ ПУ
	                      |ИЗ
	                      |	Справочник.энргПриборыУчетаАбонента КАК энргПриборыУчетаАбонента
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПУ КАК ТаблицаПУ
	                      |		ПО энргПриборыУчетаАбонента.Код = ТаблицаПУ.НомерПУ
	                      |			И энргПриборыУчетаАбонента.КодТочкиУчета = ТаблицаПУ.КодТУ
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргТипыПриборовУчета КАК энргТипыПриборовУчета
	                      |		ПО энргПриборыУчетаАбонента.ТипПрибораУчета = энргТипыПриборовУчета.Ссылка
	                      |			И (энргТипыПриборовУчета.Наименование = ТаблицаПУ.ТипПУ)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	бестПриборыТочекУчетаНПСрезПоследних.Организация КАК Организация,
	                      |	бестПриборыТочекУчетаНПСрезПоследних.Район КАК Район,
	                      |	бестПриборыТочекУчетаНПСрезПоследних.ОбъектРасчета КАК ОбъектРасчета,
	                      |	бестПриборыТочекУчетаНПСрезПоследних.ТочкаУчета КАК ТочкаУчета,
	                      |	бестПриборыТочекУчетаНПСрезПоследних.ПриборУчета КАК ПриборУчета
	                      |ПОМЕСТИТЬ ПУТочекУчета
	                      |ИЗ
	                      |	РегистрСведений.бестПриборыТочекУчетаНП.СрезПоследних(&ДатаФактическогоСобытия, ) КАК бестПриборыТочекУчетаНПСрезПоследних
	                      |ГДЕ
	                      |	бестПриборыТочекУчетаНПСрезПоследних.ПриборУчета В
	                      |			(ВЫБРАТЬ
	                      |				ПУ.Ссылка
	                      |			ИЗ
	                      |				ПУ КАК ПУ)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ТаблицаПУ.IDСтроки КАК IDСтроки,
	                      |	ТаблицаПУ.КодТУ КАК ТочкаУчетаИзФайла,
	                      |	ТаблицаПУ.НомерПУ КАК ПриборУчетаИзФайла,
	                      |	ЕСТЬNULL(бестАктивностьТочекУчетаНПСрезПоследних.Организация, ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)) КАК Организация,
	                      |	ЕСТЬNULL(бестАктивностьТочекУчетаНПСрезПоследних.Район, ЗНАЧЕНИЕ(Справочник.энргЗоныОтвественности.ПустаяСсылка)) КАК Район,
	                      |	ЕСТЬNULL(бестАктивностьТочекУчетаНПСрезПоследних.ОбъектРасчета, ЗНАЧЕНИЕ(Справочник.бестОбъектыРасчета.ПустаяСсылка)) КАК ОбъектРасчета,
	                      |	ЕСТЬNULL(бестАктивностьТочекУчетаНПСрезПоследних.ТочкаУчета, ЗНАЧЕНИЕ(Справочник.энргВидыУслуг.ПустаяСсылка)) КАК ТочкаУчета,
	                      |	ЕСТЬNULL(ПУТочекУчета.ПриборУчета, ЗНАЧЕНИЕ(Справочник.энргПриборыУчетаАбонента.ПустаяССылка)) КАК ПриборУчета,
	                      |	ЕСТЬNULL(бестОбъектыРасчета.МКД, ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяССылка)) КАК МКД
	                      |ИЗ
	                      |	ТаблицаПУ КАК ТаблицаПУ
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ПУ КАК ПУ
	                      |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПУТочекУчета КАК ПУТочекУчета
	                      |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бестАктивностьТочекУчетаНП.СрезПоследних(&ДатаФактическогоСобытия, ) КАК бестАктивностьТочекУчетаНПСрезПоследних
	                      |					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.бестОбъектыРасчета КАК бестОбъектыРасчета
	                      |					ПО бестАктивностьТочекУчетаНПСрезПоследних.ОбъектРасчета = бестОбъектыРасчета.Ссылка
	                      |				ПО ПУТочекУчета.ТочкаУчета = бестАктивностьТочекУчетаНПСрезПоследних.ТочкаУчета
	                      |					И (бестАктивностьТочекУчетаНПСрезПоследних.Организация = ПУТочекУчета.Организация)
	                      |					И (бестАктивностьТочекУчетаНПСрезПоследних.Район = ПУТочекУчета.Район)
	                      |					И (бестАктивностьТочекУчетаНПСрезПоследних.ОбъектРасчета = ПУТочекУчета.ОбъектРасчета)
	                      |					И (бестАктивностьТочекУчетаНПСрезПоследних.Состояние = ЗНАЧЕНИЕ(Перечисление.энргСостояниеТочекУчета.Включена))
	                      |			ПО ПУ.Ссылка = ПУТочекУчета.ПриборУчета
	                      |		ПО (ПУ.IDСтроки = ТаблицаПУ.IDСтроки)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	бестЗагруженныеДанныеИзВнешнихИсточников.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.бестЗагруженныеДанныеИзВнешнихИсточников КАК бестЗагруженныеДанныеИзВнешнихИсточников
	                      |ГДЕ
	                      |	НЕ бестЗагруженныеДанныеИзВнешнихИсточников.ПометкаУдаления
	                      |	И бестЗагруженныеДанныеИзВнешнихИсточников.Дата = &Дата
	                      |	И бестЗагруженныеДанныеИзВнешнихИсточников.ФайлДляЧтения = &ФайлДляЧтения");
	
	Запрос.УстановитьПараметр("ТаблицаПУ", Отборы.ТаблицаПУ);
	Запрос.УстановитьПараметр("ДатаФактическогоСобытия", Отборы.ДатаФактическогоСобытия);
	Запрос.УстановитьПараметр("Дата", Отборы.Дата); 
	Запрос.УстановитьПараметр("ФайлДляЧтения", Отборы.ФайлДляЧтения);
	Возврат Запрос.ВыполнитьПакет();
	
КонецФункции 

Процедура ПрочитатьЛистExcel(ЛистЭксель, ПараметрыФункции) 
	
	ТЗПриборыУчета = ПараметрыФункции.ТаблицаПУ;
	ТЗПредоставленныеОбъемы = ПараметрыФункции.ПредоставленныеОбъемы;
	
	НомерПервойКолонки = 3;  
	ПоследняяСтрока = ЛистЭксель.Cells(1,1).SpecialCells(11).Row;
	ПоследнийСтолбец = ЛистЭксель.Cells(1,1).SpecialCells(11).Column;
	Для Колонка = НомерПервойКолонки По ПоследнийСтолбец Цикл
		Если СокрЛП(ЛистЭксель.Cells(9, Колонка).Text) = "" Тогда
			Прервать;
		КонецЕсли;
		
		ИдентификаторСтрокиПУ = Строка(Новый УникальныйИдентификатор);
		СтрокаПУ = ТЗПриборыУчета.Добавить();
		СтрокаПУ.IDСтроки = ИдентификаторСтрокиПУ;
		СтрокаПУ.ПриборУчета = СокрЛП(ЛистЭксель.Cells(9, Колонка).Text);
		СтрокаПУ.КодТУ = СокрЛП(ЛистЭксель.Cells(10, Колонка).Text);
		СтрокаПУ.ТипПУ = СокрЛП(ЛистЭксель.Cells(11, Колонка).Text);

		НомерПервойСтроки = 17;
		Для Строка = НомерПервойСтроки По ПоследняяСтрока Цикл 
			СтрокаОбъем = ТЗПредоставленныеОбъемы.Добавить();
			СтрокаОбъем.IDСтроки = ИдентификаторСтрокиПУ;
		    СтрокаОбъем.Объем = Число(СокрЛП(ЛистЭксель.Cells(Строка, Колонка).Text));
			ДеньИзФайла = СокрЛП(ЛистЭксель.Cells(Строка, 1).Text);
	        СтрокаОбъем.День = Дата(Прав(ДеньИзФайла, 4), Сред(ДеньИзФайла, 3, 2), Лев(ДеньИзФайла, 2));
			СтрокаОбъем.Час = СокрЛП(ЛистЭксель.Cells(Строка, 2).Text);	
		КонецЦикла;  
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
